start_message = "👋 Привет, дорогой житель общежития!\n" \
"Добро пожаловать в нашего бота! 🎉 Здесь ты сможешь:" \
"\n   📅 Узнавать о новых мероприятиях и событиях" \
"\n   ⏰ Включать напоминания о мероприятиях, чтобы ничего не пропустить" \
"\n   📊 Проверять свои баллы и следить за достижениями" \
"\nМы активно развиваем нашего бота, и функционал будет только расширяться! 🚀 Мы здесь, чтобы сделать твоё пребывание в общежитии ещё более комфортным и интересным. Если у тебя есть вопросы или предложения, просто напиши нам! 😊" \
"👉 Нажми на кнопку ниже, чтобы начать!"

fedback_message ="🛠️ Мы всегда стремимся к улучшению!\n" \
"Если ты заметил ошибку или у тебя есть пожелания по работе нашего бота, не стесняйся сообщить нам! Твое мнение очень важно для нас! 💬\n" \
"📩 Напиши мне напрямую: @I_Pavel_Durov\n" \
"Мы ценим твою помощь и будем рады любым предложениям! Спасибо, что делаешь наш бот лучше! 😊"

my_events_message = "📅 Твои мероприятия\n" \
"Здесь ты можешь просмотреть все свои запланированные мероприятия! Убедись, что ничего не пропустил и будь в курсе всех событий! 🎉\n" \
"👉 Нажми на кнопку ниже, чтобы увидеть свои мероприятия:"

default_photo_url = "https://sun9-55.userapi.com/impg/3yfujLRXLpXtRTAiFS9HszKNWMpoNvKDxIXqfA/JSy5Xxzq2PU.jpg?size=502x502&quality=96&sign=a999f0707ea8ea74e1872394170ed70d&type=album"

studsovet_urls=(
    # Леша
    "https://sun9-9.userapi.com/impg/jwFZPsEO4QS76TGA9lj6CrEBggpwlbKb7G9hHA/FqZOYvofSnA.jpg?size=1080x1443&quality=95&sign=64e81b5261155bdeb1ef61eb9a01f9af&type=album",
    # ЛИза
    "https://vk.com/photo-43168103_457248102",
    # Малика
    "https://vk.com/photo-43168103_457248097",
    # Саша
    "https://vk.com/photo-43168103_457248100",
    # ГУля
    "https://vk.com/photo-43168103_457248101",
    # Lesha Jarov
    "https://vk.com/photo-43168103_457248105",
    # Байрам
    "https://sun9-6.userapi.com/impg/2tG-JRso3HoiIrfFmMWWbH7HWU4TFAg28Uy_bg/RF4p0g2Sjvo.jpg?size=959x971&quality=95&sign=77aa03526f77a7169d56defcae23da43&type=album",
    # Yroslav
    "https://vk.com/photo-43168103_457248091",
    # Илья
    "https://vk.com/photo-43168103_457248096",
    # Didar
    "https://vk.com/photo-43168103_457248092",
    # Djelil
    "https://vk.com/photo-43168103_457248094",
    # Jeny
    "https://vk.com/photo-43168103_457248093",
    # Vany
    "https://vk.com/photo-43168103_457248099",
    # Leny
    "https://vk.com/photo-43168103_457248095",
    # Sasha
    "https://vk.com/photo-43168103_457248103"
)

studsovet_list = (
    "👨‍⚖️ <b>Алексей Самойлов</b> \n    <i>Председатель студенческого совета</i>",
    "📝 <b>Елизавета Евгеньевна</b> \n<i>Секретарь студенческого совета</i>",
    "🎓 <b>Малика Абдрахимова</b> \n<i>Профорг студенческого совета</i>",
    "📢 <b>Александра Пинегина</b> \n<i>Руководитель информационного сектора</i>",
    "🧼 <b>Гуля Ханова</b> \n<i>Руководитель санитарного сектора</i>",
    "🏅 <b>Алексей Жаров</b> \n<i>Руководитель спортивно-массового сектора</i>",
    "🎉 <b>Джораев Байрамгелди</b> \n<i>Соруководитель культурно-массового сектора</i>",
    "🎉 <b>Ярослав Григорьев</b> \n<i>Руководитель культурно-массового сектора</i>",
    "🛌 <b>Илья Гильдебрандт</b> \n<i>Староста 1 этажа</i>",
    "🛌 <b>Дидар Айдогдыев</b> \n<i>Староста 2 этажа левого крыла</i>",
    "🛌 <b>Джелил</b> \n<i>Староста 2 этажа правого крыла</i>", 
    "🛌 <b>Евгений Кузяев</b> \n<i>Староста 3 этажа левого крыла</i>",
    "🛌 <b>Иван Иванов</b> \n<i>Староста 3 этажа правого крыла</i>",
    "🛌 <b>Леонид Омельяненко</b> \n<i>Староста 4 этажа левого крыла</i>",
    "🛌 <b>Александр Шилов</b> \n<i>Староста 4 этажа правого крыла</i>"
)


studsovet_message = "👥 Студенческий совет нашего общежития\n" \
"Познакомься с командой, которая заботится о твоём комфорте и интересах\n\n"\
"Если у тебя есть вопросы или предложения, не стесняйся обращаться к членам студенческого совета! Мы всегда готовы помочь! 😊"

spam_messages = (
    "👋 Привет! Не забывай, что я здесь, чтобы помочь тебе с"\
"информацией о нашем общежитии! Если у тебя есть вопросы, просто напиши мне! 💬",
    
    "✨ Привет! Как проходит твой день? Не забывай, что у нас есть много" \
"интересного, что может повлиять на твои достижения! 😉 Если ты хочешь узнать больше, просто дай знать! 📊",
    
    "📅 Привет! Как твои дела? Если тебе нужна информация о мероприятиях или новостях общежития, я всегда на связи! 🏠",
    
    "🌈 Здравствуй! Надеюсь, у тебя отличный день! Не забывай, что у нас есть "\
"много факторов, которые могут повлиять на твои достижения. Если хочешь узнать больше, я всегда на связи! 📈",

    "📅 Здравствуй! Как настроение? Напоминаю, что у нас есть много возможностей, которые "\
"могут повлиять на твои успехи. Если хочешь обсудить, я здесь! 🤗",

)
